Repository: TelekomCloud/i18n-test
Catalog: doc/myguide/source/locale/*/LC_MESSAGES/intro.po
Languages: de, ko

source: Intro
de: Einleitung
ko: 소개

source: Here is a solution described as :ref:`Sphinx <sphinx:examples>` how to reach a multi-language documentation service.
de: Hier ist eine Lösung beschrieben in :ref:`sphinx <sphinx:examples>` wie eine mehrsprachiger Dokumentationsdienst zu erreichen ist.
ko: :ref:`Sphinx <sphinx:examples>` 에 설명되었듯이 어떻게 다국어 문서 서비스에 도달하는지에 대한 해결책이 있습니다.

source: Why Sphinx?
de: Warum Sphinx?
ko: 왜 Sphinx인가?

source: Sphinx is used to document :ref:`Python <python:functions>`. Documentation strings from Python modules are fetched and Sphinx will generate documentation from that.
de: Sphinx wird zur Dokumentation von :ref:`Python <python:functions>` benutzt. Dokumentationstrings von Python-Modulen werden abgerufen und Sphinx baut daraus Dokumentation.
ko: Sphinx는 :ref:`Python <python:functions>` 을 문서화하는데 사용합니다. Python 모듈에서 문서 문자열들을 가져와서 Sphinx는 문서를 생성합니다.

source: Output
de: Ausgabe
ko: 결과물

source: For the output there are different :ref:`Builders <sphinx:builders>`. You can choose between single- or multi-page HTML, TXT, PDF, or ePub. There are also other output formats like JSON, XML, or man-pages. With `hieroglyph <http://docs.hieroglyph.io>`__ you can also generate slides. The builder will also make syntax- and link checks for the documents.
de: Zur Ausgabe stehen verschiedene :ref:`Builder <sphinx:builders>` zur Verfügung. Du kannst wählen zwischen single- oder multi-page HTML, TXT, PDF oder ePub. Es gibt noch andere Ausgabeformate wie JSON, XML oder man-pages. Mit `hieroglyph <http://docs.hieroglyph.io>`__ kannst Du auch Folien generieren. Der Builder wird auch einen Syntaxcheck machen und Links in den Dokumenten überprüfen.
ko: 결과물로는 서로 다른 :ref:`Builders <sphinx:builders>` 에 따라 달라집니다. 단일 또는 여러 페이지 HTML, TXT, PDF, 또는 ePub에서 선택할 수 있습니다. JSON, XML, 또는 man 페이지와 같은 다른 출력 포맷 또한 있습니다. `hieroglyph <http://docs.hieroglyph.io>`__ 를 통해서는 슬라이드를 생성할 수 있습니다. 해당 builder로는 문서에 대해 또한 문법 및 링크를 검사하도록 만들 수도 있습니다.

source: Input
de: Eingabe
ko: 입력

source: The documents are written in :ref:`restructuredtext <sphinx:rst-primer>`
de: Die Dokumente sind geschrieben in :ref:`restructuredtext <sphinx:rst-primer>`
ko: 문서는 :ref:`restructuredtext <sphinx:rst-primer>` 로 작성합니다

source: The syntax is pretty easy, i.e. :ref:`print tables <sphinx:rst-tables>`. Or print code:
de: Die Syntax ist recht einfach, z.B.. :ref:`print tables <sphinx:rst-tables>`. Oder print code:
ko: 문법은 매우 쉽습니다: :ref:`print tables <sphinx:rst-tables>`. 또는 코드를 출력합니다:

source: Or :download:`download the document <intro.rst>`.
de: Oder :download:`Lade das Dokument herunter <intro.rst>`.
ko: 또는 :download:`download the document <intro.rst>`.

source: :ref:`Markdown <sphinx:markdown>` is also supported as source.
de: :ref:`Markdown <sphinx:markdown>` wird auch als Quelle unterstützt.
ko: :ref:`Markdown <sphinx:markdown>` 또한 입력으로 지원합니다.

source: Other things in Sphinx are :ref:`templating <sphinx:templating>`. Default template engine is `Jinja <http://jinja.pocoo.org/>`__. You can use variables in loops to work with data from json files or others.
de: Andere Dinge in Sphinx sind :ref:`templating <sphinx:templating>`. Standard Templatemaschine ist `Jinja <http://jinja.pocoo.org/>`__. Du kannst Variablen in Loops benutzen, um mit Daten aus json Dateien zu arbeiten und solche Sachen.
ko: 스핑크스의 다른 것들 : ref :`templating <sphinx : templating>`. 기본 템플릿 엔진은`Jinja <http://jinja.pocoo.org/>`__입니다. 루프의 변수를 사용하여 json 파일이나 다른 파일의 데이터로 작업 할 수 있습니다.

source: Last but not least to highlight are :ref:`Themes <sphinx:builtin-themes>`. There are some themes included in Sphinx and the standard theme has multiple options to configure. But you can also build yuur own theme, or `look what Python Packages are available for Sphinx Theme <https://pypi.python.org/pypi?%3Aaction=search&term=Sphinx+Theme&submit=search>`__
de: Zum Schluss noch ein Highlight und das sind :ref:`Themes <sphinx:builtin-themes>`. Es gibt verschiedene Themes zur Auswahl und bereits bei Sphinx mit dabei sind Standard-Themens mit vielfältigen Konfigurationsmöglichkeiten. Aber Du kannst auch Dein eigenes Theme bauen. Oder `Schau was es für Python Pakete für Sphinx Theme gibts <https://pypi.python.org/pypi?%3Aaction=search&term=Sphinx+Theme&submit=search>`__
ko: 마지막으로 강조해야 할 것은 ref :`Themes <sphinx : builtin-themes>`입니다. 스핑크스에는 몇 가지 테마가 포함되어 있으며 표준 테마에는 구성 할 여러 옵션이 있습니다. 그러나 yuur 자신의 테마를 만들거나`Sphinx Theme <https://pypi.python.org/pypi?%3Aaction=search&term=Sphinx+Theme&submit=search>`__에 Python 패키지를 사용할 수 있는지 살펴보십시오

source: Search Engine
de: Suchmaschine

source: :ref:`A search engine <sphinx:search>` is included.
de: :ref:`Eine Suchmaschine <sphinx:search>` ist mit dabei.

source: Not enough?
de: Nicht genug?

source: And mark a timestamp without and script language
de: Ein Zeitstempel ohne jegliche Script-Sprache

source: And who is using Sphinx?
de: Und wer benutzt Sphinx?
ko: 그리고 누가 Sphinx를 사용하고 있습니까?

source: others:
de: andere:

source: Templating
ko: 템플릿화

source: Themes
ko: 테마
