Repository: TelekomCloud/i18n-test
Catalog: doc/myguide/source/locale/*/LC_MESSAGES/start.po
Languages: de

source: Getting Started
de: Anfangen

source: Common workflow of documentation is:
de: Üblicher Arbeitsablauf bei Dokumentationen ist:

source: Our workflow will be:
de: Unser Arbeitsablauf wird sein:

source: Text Editor
de: Texteditoren

source: There ara variuous tools for different platforms with RST support
de: Es sind verschiedene Werkzeuge für verschiedene Plattformen verfügbar, die RST unterstützen

source: Build Tools
de: Bauwerkzeuge

source: It's all described in :ref:`sphinx`. Sphinx package includes all tools to check and build the documents.
de: Ist alles beschrieben in :ref:`sphinx`. Das Sphinx Paket beinhaltet alle Werkzeuge zum Überprüfen und bauen der Dokumente.

source: Translation Platform
de: Übersetzungsplattform

source: In the chapter :ref:`zanata` it's described, how Zanata can help us to translate text strings in differenz languages.
de: Im Kapitel :ref:`zanata` ist beschrieben, wie Zanata uns helfen kann, Textstrings in verschiedene Sprachen zu übersetzen.

source: Publishing
de: Veröfffentlichen

source: Compiled HTML pages can served on our own webserver (see :ref:`lxdcontainer`) Or we use the pretty online service :ref:`Readthedocs`)
de: Kompilierte HTML Seiten können durch unseren eigenen Webserver ausgeliefert werden (siehe :ref:`lxdcontainer`) Oder wir benutzen den grossartigen Onlinedienst :ref:`Readthedocs`)

source: To build our own sphinx build and translation platform, we simple use `LXD Container <https://www.ubuntu.com/containers/lxd>`__. If your LXD environment is initialized, just do it::
de: Um unsere eigene Sphinx-Bau- und Übersetzungsplattform zu bauen, benutzen wir einfach `LXD Container <https://www.ubuntu.com/containers/lxd>__`. Wenn Deine LXD Umgebung initialisiert ist, mach einfach::

source: Of course, any other Ubuntu system can be used.
de: Du kannst natürlich auch jedes andere Ubuntu System benutzen.
