Repository: TelekomCloud/i18n-test
Catalog: doc/myguide/source/locale/*/LC_MESSAGES/zanata.po
Languages: de

source: Translate the world
de: Übersetze die Welt

source: or: How to build your own infrastructure for multi-language documentation.
de: oder: Wie wird eine Infrastruktur für eine mehrsprachige Dokumentation aufgebaut.

source: Imagine there are about 194 countries on the world, most of them with one or more then one language. And countless dialects, like Saxon. How you want to reach all your customer if your products or services are only described in ONE language?
de: Stell Dir vor, es gibt 194 Länder auf der Welt, jede mit mehreren oder mindestens einer Sprache. Dann endlos viele Dialekte, wie sächsisch. Wie willst Du all Deine Kunden erreichen, wenn Deine Produkte oder Dienste nur in EINER Sprache beschrieben sind?

source: `Zanata <http://zanata.org>`__ is a web-based translation platform for translators, content creators and developers to manage localization projects. Zanata is Open Source. The Installation is divided in server and client.
de: `Zanata <http://zanata.org>`__ ist eine web-basierte Übersetzungsplattform für Übersetzer, Content-Ersteller und Entwickler zur Verwaltung von Lokalisations-Projekten.. Zanata ist Open Source. Die Installation unterscheidet sich in Server und Client.

source: Zanata requires Java, Apache, Wildfly, MySQL, and an e-mail service. For easy installation we use Puppet, specially `puppet-zanata <https://github.com/openstack-infra/puppet-zanata>`__ All installation steps are done by **root**
de: Zanata benötigt Java, Apache, Wildfly, MySQL und einen E-Mail-Dienst. Für eine einfache Installation benutzen wir Puppet, speziell `puppet-zanata <https://github.com/openstack-infra/puppet-zanata>`__ Alle Installationsschritte werden als **root** ausgeführt

source: Install deb packages::
de: Installation Debian Pakete::

source: Clone Git repositories::
de: Git Repository klonen::

source: Create MySQL client file::
de: MySQL Client Datei erstellen::

source: Create Puppet manifest::
de: Puppet Manifest erstellen::

source: Execute the manifest::
de: Manifest ausführen::

source: Check on the web browser if Zanata server is running. Depends on the `filesystem <https://docs.jboss.org/author/display/WFLY10/AIO+-+NIO+for+messaging+journal>`__ , it's required to configure JBoss::
de: Überprüfe im Web-Browser, ob der Zanata-Server läuft. Abhängig vom `Dateisystem <https://docs.jboss.org/author/display/WFLY10/AIO+-+NIO+for+messaging+journal>`__ , ist es erforderlich, JBoss umzukonfigurieren::

source: With Puppet the configured admin user is **admin**. That means, if you start the register process, go through the OpenID login process, you should use the username **admin** to get admin privileges for your account. After login generate your API key in User Settings->Client in your profile. The API key is for authorization on the server::
de: Durch Puppet wird der Benutzer **admin** konfiguriert. Das bedeutet, dass Du bei der Registrierung Deines Accounts durch den OpenID Loginprozess diesen Benutzernamen wählen solltest, um Adminrechte für den Account zu bekommen. Nach dem Login erstellen wir einen API Schlüssel in Benutzereinstellungen->Client in Deinem Profil. Der API Schlüssel ist für die Authorisierung am Server::

source: Now you may setup a new project in Zanata and add languages to the project. Of course, you should join a language team. Here are some screenshots from what do you can expect:
de: Nun kannst Du in Zanata ein neues Projekt einrichten und Sprachen zum Projekt hinzufügen. Natürlich solltest Du auch einem Sprachteam beitreten. Hier sind einige Screenshots, von dem was Dich erwartet:

source: New project:
de: Neues Projekt:

source: New version:
de: Neue Version:

source: Configure gettext:
de: Gettext konfigurieren:

source: Configure languages:
de: Sprachen konfigurieren:

source: Add languages to project:
de: Neue Sprachen zum Projekt hinzufügen:

source: More information for Zanata usage are available on
de: Mehr Informationen zu Zanata sind verfügbar

source: Thank goodness Zanata client installation is much easier::
de: Gottseidank ist die Installation des Zanata Client wesentlich einfacher::

source: That's it :-)
de: Das wars :-)
